Removed mermaid dependencies
